UTAF_Base/requestFiles/PTS_UpdatePerson_withOnlyPerson.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://api.web.bc/capability/business/b182-01/objects/requestsubmitpersonupdating/flv000164/v1" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v12="http://api.web.bc/capability/business/b182-01/services/personupdating/flv000164/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1">
   <soapenv:Header>
      <v2:CommonContextRequest>
         <v2:transaction>
            <v1:messageId>${Req_corrId}</v1:messageId>
            <!--Optional:-->
            <v1:correlationId>${Req_corrId}</v1:correlationId>
            <v1:conversationId>${Req_conversationId}</v1:conversationId>
            <v1:dateTimeCreated>${Req_dateTimeCreated}</v1:dateTimeCreated>
         </v2:transaction>
         <!--Optional:-->
      </v2:CommonContextRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v12:RequestDataSubmitPersonUpdating>
         <v12:serviceContext>
            <v12:transactionData>
               <!--Optional:-->
               <v12:endUserId>PTS</v12:endUserId>
               <!--Optional:-->
               <v12:endUserLanguage>EN</v12:endUserLanguage>
               <v12:consumerApplication>SHE</v12:consumerApplication>
            </v12:transactionData>
         </v12:serviceContext>
         <v12:serviceData>
            <v12:person>
               <v13:name>
                  <!--Optional:-->
                  <v13:firstName>${Req_firstName}</v13:firstName>
                  <!--Optional:-->
                  <v13:preferredFirstName>${Req_preferredFirstName}</v13:preferredFirstName>
                  <v13:lastName>${Req_lastName}</v13:lastName>
               </v13:name>
               <!--Optional:-->              
               <!--Optional:-->
               <v13:birthDate>${Req_birthDate}</v13:birthDate>
               <!--Optional:-->

               <v13:party>
                  <!--Optional:-->
                  <v13:legalLanguage>
                     <v13:alpha2Code>${Req_legalLanguage_alpha2Code}</v13:alpha2Code>
                  </v13:legalLanguage>
                  <v13:preferredCommunicationLanguage>
                    <v13:alpha2Code>${Req_preferredCommunicationLanguage_alpha2Code}</v13:alpha2Code>
                  </v13:preferredCommunicationLanguage>
                  <v13:legalAddress>
                     <v13:geographicAddressIdentifier>
                        <v13:id>${Req_geographicAddressIdentifier_id}</v13:id>                       
                        <v13:idContext>
                           <v13:value>${Req_idContext_value}</v13:value>
                        </v13:idContext>
                     </v13:geographicAddressIdentifier>
                  </v13:legalAddress>
               </v13:party>
               <v13:identifier>
                  <v13:id>${Req_identifier_id}</v13:id>
                  <!--Optional:-->
                  <v13:idScope>
                     <v13:value>ENT</v13:value>
                  </v13:idScope>
                  <!--Optional:-->
                  <v13:idContext>
                     <v13:value>B182</v13:value>
                  </v13:idContext>
               </v13:identifier>
               
            </v12:person>
         </v12:serviceData>
      </v12:RequestDataSubmitPersonUpdating>
   </soapenv:Body>
</soapenv:Envelope>
